package com.censoft.Util;

import lombok.Getter;

/**
 * @author 郑军
 * @创建人: 杨文培
 * @创建时间: 2019/5/17 21:48
 * @描述: 返回状态码
 */
@Getter
public enum ResultStatusEnum {
    S_10000(10000, "获取信息失败"),
    S_10001(10001, "您的手机号已经注册,请直接登录"),
    S_10002(10002, "您的身份证已经被绑定"),
    S_10003(10003, "您的邮箱已经注册,请直接登录"),
    S_10004(10004, "注册失败"),
    S_10005(10005, "注册成功"),
    S_10006(10006, "验证码输入错误或失效，请您重新发送!"),
    S_10007(10007, "验证成功，请完善信息"),
    S_10008(10008, "验证失败，请重新发送验证码"),
    S_10009(10009, "验证码发送成功"),
    S_10010(10010, "验证码发送失败，请重新发送"),
    S_10011(10011, "填写参数(手机号/邮箱)有误"),
    S_10012(10012, "该邮箱已经被绑定"),
    S_10013(10013, "该手机已经被绑定"),
    S_10014(10014, "填写内容错误"),
    S_10015(10015, "社会信用码，已经绑定部门"),
    S_10016(10016, "更新密码失败，请您重试"),
    S_10017(10017, "操作成功"),
    S_10018(10018, "您的手机号还未注册,请前往注册"),
    S_10019(10019, "您的邮箱还未注册,请前往注册"),
    S_10020(10020, "提交审核失败"),
    S_10021(10021, "出现未知错误"),
    S_10022(10022, "Verification code input error or invalid, please send again!"),
    S_10023(10023, "Verify successful, please complete the information"),
    S_10024(10024, "您的邮箱已经绑定"),
    S_10025(10025, "基本信息维护失败"),
    S_10026(10026, "获取用户信息失败"),
    S_10027(10027, "用户未填写扩展信息"),
    S_10028(10028, "添加留学经历失败"),
    S_10029(10029, "修改留学经历失败"),
    S_10030(10030, "删除留学经历失败"),
    S_10031(10031, "您输入的姓名和身份证号有误"),
    S_10032(10032, "该用户不存在"),
    S_10033(10033, "实名认证失败,请核实个人信息"),
    S_10034(10034, "用户已进行实名认证"),
    S_10035(10035, "数据存在异常，存在多条信息"),
    S_10036(10036, "该身份证用户未注册，请前往注册"),
    S_10037(10037, "该用户信息不存在"),
    S_10038(10038, "找回用户信息失败"),
    S_10039(10039, "找回用户信息成功"),
    ;

    private Integer status;
    private String massage;

    public Integer getStatus() {
        return status;
    }

    public String getMassage() {
        return massage;
    }

    ResultStatusEnum(Integer status, String massage) {
        this.status = status;
        this.massage = massage;
    }
}
